In [1]:
import pandas as pd
import numpy as np

## TH1

In [2]:
data1 = {"Hoten": ['nva', 'nvb'],
         "Diachi": ['137 NCT', '227 NVC']}
df1 = pd.DataFrame(data1)
df1

  Hoten   Diachi
0   nva  137 NCT
1   nvb  227 NVC

In [4]:
data2 = {"Hoten": ['nva', 'nvb', 'nvc'],
         "Dienthoai": ['123456', '456789', '444555']}
df2 = pd.DataFrame(data2)
df2

  Hoten Dienthoai
0   nva    123456
1   nvb    456789
2   nvc    444555

In [5]:
df_new1 = pd.concat([df1, df2], axis=1)
df_new1

  Hoten   Diachi Hoten Dienthoai
0   nva  137 NCT   nva    123456
1   nvb  227 NVC   nvb    456789
2   NaN      NaN   nvc    444555

## TH2

In [6]:
data1 = {"Hoten": ['nva', 'nvb'],
         "Diachi": ['137 NCT', '227 NVC']}
df1 = pd.DataFrame(data1)
df1

  Hoten   Diachi
0   nva  137 NCT
1   nvb  227 NVC

In [8]:
data2 = {"Hoten": ['nvc', 'ltd'],
         "Diachi": ['111 LHP', '222 HV'],
         "Dienthoai": ['123456', '456789']}
df2 = pd.DataFrame(data2)
df2

  Hoten   Diachi Dienthoai
0   nvc  111 LHP    123456
1   ltd   222 HV    456789

In [10]:
df_new2 = pd.concat([df1, df2], axis=0, ignore_index=True)
df_new2

  Hoten   Diachi Dienthoai
0   nva  137 NCT       NaN
1   nvb  227 NVC       NaN
2   nvc  111 LHP    123456
3   ltd   222 HV    456789

## Đọc từ nhiều file

In [11]:
# đọc 3 file: ds_1.csv, ds_02.csv và ds3.csv trong thư mục data
import glob as gl

In [12]:
list_files = gl.glob("data/ds*.csv")
list_files

['data\\ds3.csv', 'data\\ds_02.csv', 'data\\ds_1.csv']

In [13]:
lst_data = []
for file in list_files:
    df_temp = pd.read_csv(file)
    lst_data.append(df_temp)

df_all = pd.concat(lst_data, ignore_index=True)
df_all

  Hoten  Dienthoai
0   ltd     666555
1   nvc     444555
2   nva     111222
3   nvb     222333